*** src/tennis_scoring.rs:20:9: replace TennisGame::set_names with ()

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace TennisGame::set_names with ()
@@ -12,18 +12,17 @@
     pub fn new() -> Self {
         TennisGame::default()
     }
 }
 
 impl TennisGame {
 
     pub fn set_names(&mut self, player1_name: String, player2_name: String) {
-        self.player1_name = player1_name;
-        self.player2_name = player2_name;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn set_score(&mut self, score1: u8, score2: u8) -> &mut Self {
         self.score1 = score1;
         self.score2 = score2;
 
         return self;
     }

---- tennis_scoring_tests::check_score::case_09 stdout ----
thread 'tennis_scoring_tests::check_score::case_09' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for "
 right: "Win for player2"

---- tennis_scoring_tests::check_score::case_08 stdout ----
thread 'tennis_scoring_tests::check_score::case_08' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for "
 right: "Win for player1"

---- tennis_scoring_tests::check_score::case_10 stdout ----
thread 'tennis_scoring_tests::check_score::case_10' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for "
 right: "Win for player1"

failures:
    tennis_scoring_tests::check_score::case_08
    tennis_scoring_tests::check_score::case_09
    tennis_scoring_tests::check_score::case_10
    tennis_scoring_tests::check_score::case_11
    tennis_scoring_tests::check_score::case_12
    tennis_scoring_tests::check_score::case_13
    tennis_scoring_tests::check_score::case_14
    tennis_scoring_tests::check_score::case_15
    tennis_scoring_tests::check_score::case_16
    tennis_scoring_tests::check_score::case_17
    tennis_scoring_tests::check_score::case_18
    tennis_scoring_tests::check_score::case_19

test result: FAILED. 26 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
