*** src/tennis_scoring.rs:25:9: replace TennisGame::set_score -> &mut Self with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace TennisGame::set_score -> &mut Self with Box::leak(Box::new(Default::default()))
@@ -17,20 +17,17 @@
 impl TennisGame {
 
     pub fn set_names(&mut self, player1_name: String, player2_name: String) {
         self.player1_name = player1_name;
         self.player2_name = player2_name;
     }
 
     pub fn set_score(&mut self, score1: u8, score2: u8) -> &mut Self {
-        self.score1 = score1;
-        self.score2 = score2;
-
-        return self;
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get_score(&self) -> String {
         // Game Over Situation (One player wins)
         if (self.score1 == 4 && self.score2 <= 2)
             || (self.score1 > 4 && self.score1 >= (self.score2 + 2))
         {
             return format!("Win for {}", self.player1_name);

---- tennis_scoring_tests::check_score::case_04 stdout ----
thread 'tennis_scoring_tests::check_score::case_04' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Love-All"
 right: "Thirty-All"

---- tennis_scoring_tests::check_score::case_08 stdout ----
thread 'tennis_scoring_tests::check_score::case_08' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Love-All"
 right: "Win for player1"

---- tennis_scoring_tests::check_score::case_02 stdout ----
thread 'tennis_scoring_tests::check_score::case_02' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Love-All"
 right: "Fifteen-All"

failures:
    tennis_scoring_tests::check_score::case_02
    tennis_scoring_tests::check_score::case_03
    tennis_scoring_tests::check_score::case_04
    tennis_scoring_tests::check_score::case_05
    tennis_scoring_tests::check_score::case_06
    tennis_scoring_tests::check_score::case_07
    tennis_scoring_tests::check_score::case_08
    tennis_scoring_tests::check_score::case_09
    tennis_scoring_tests::check_score::case_10
    tennis_scoring_tests::check_score::case_11
    tennis_scoring_tests::check_score::case_12
    tennis_scoring_tests::check_score::case_13

test result: FAILED. 3 passed; 44 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
