*** src/tennis_scoring.rs:33:25: replace == with != in TennisGame::get_score

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace == with != in TennisGame::get_score
@@ -25,17 +25,17 @@
         self.score1 = score1;
         self.score2 = score2;
 
         return self;
     }
 
     pub fn get_score(&self) -> String {
         // Game Over Situation (One player wins)
-        if (self.score1 == 4 && self.score2 <= 2)
+        if (self.score1 != /* ~ changed by cargo-mutants ~ */ 4 && self.score2 <= 2)
             || (self.score1 > 4 && self.score1 >= (self.score2 + 2))
         {
             return format!("Win for {}", self.player1_name);
         }
 
         if (self.score2 == 4 && self.score1 <= 2)
             || (self.score2 > 4 && self.score2 >= (self.score1 + 2))
         {

---- tennis_scoring_tests::check_score::case_03 stdout ----
thread 'tennis_scoring_tests::check_score::case_03' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for player1"
 right: "Thirty-All"

---- tennis_scoring_tests::check_score::case_05 stdout ----
thread 'tennis_scoring_tests::check_score::case_05' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for player1"
 right: "Thirty-All"

---- tennis_scoring_tests::check_score::case_01 stdout ----
thread 'tennis_scoring_tests::check_score::case_01' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for player1"
 right: "Love-All"

failures:
    tennis_scoring_tests::check_score::case_01
    tennis_scoring_tests::check_score::case_02
    tennis_scoring_tests::check_score::case_03
    tennis_scoring_tests::check_score::case_04
    tennis_scoring_tests::check_score::case_05
    tennis_scoring_tests::check_score::case_06
    tennis_scoring_tests::check_score::case_07
    tennis_scoring_tests::check_score::case_08
    tennis_scoring_tests::check_score::case_10
    tennis_scoring_tests::check_score::case_12
    tennis_scoring_tests::check_score::case_28
    tennis_scoring_tests::check_score::case_29

test result: FAILED. 28 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
