*** src/tennis_scoring.rs:33:45: replace <= with > in TennisGame::get_score

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace <= with > in TennisGame::get_score
@@ -25,17 +25,17 @@
         self.score1 = score1;
         self.score2 = score2;
 
         return self;
     }
 
     pub fn get_score(&self) -> String {
         // Game Over Situation (One player wins)
-        if (self.score1 == 4 && self.score2 <= 2)
+        if (self.score1 == 4 && self.score2 > /* ~ changed by cargo-mutants ~ */ 2)
             || (self.score1 > 4 && self.score1 >= (self.score2 + 2))
         {
             return format!("Win for {}", self.player1_name);
         }
 
         if (self.score2 == 4 && self.score1 <= 2)
             || (self.score2 > 4 && self.score2 >= (self.score1 + 2))
         {

---- tennis_scoring_tests::check_score::case_08 stdout ----
thread 'tennis_scoring_tests::check_score::case_08' panicked at src/tennis_scoring.rs:66:65:
called `Option::unwrap()` on a `None` value

---- tennis_scoring_tests::check_score::case_10 stdout ----
thread 'tennis_scoring_tests::check_score::case_10' panicked at src/tennis_scoring.rs:66:65:
called `Option::unwrap()` on a `None` value

---- tennis_scoring_tests::check_score::case_12 stdout ----
thread 'tennis_scoring_tests::check_score::case_12' panicked at src/tennis_scoring.rs:66:65:
called `Option::unwrap()` on a `None` value

failures:
    tennis_scoring_tests::check_score::case_08
    tennis_scoring_tests::check_score::case_10
    tennis_scoring_tests::check_score::case_12
    tennis_scoring_tests::check_score::case_15
    tennis_scoring_tests::check_score::case_20
    tennis_scoring_tests::check_score::case_23
    tennis_scoring_tests::check_score::case_40

test result: FAILED. 40 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
