*** src/tennis_scoring.rs:33:9: replace TennisGame::get_score -> String with "xyzzy".into()

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace TennisGame::get_score -> String with "xyzzy".into()
@@ -25,46 +25,11 @@
         self.score1 = score1;
         self.score2 = score2;
 
         return self;
     }
 
     pub fn get_score(&self) -> String {
         // Game Over Situation (One player wins)
-        if (self.score1 == 4 && self.score2 <= 2)
-            || (self.score1 > 4 && self.score1 >= (self.score2 + 2))
-        {
-            return format!("Win for {}", self.player1_name);
-        }
-
-        if (self.score2 == 4 && self.score1 <= 2)
-            || (self.score2 > 4 && self.score2 >= (self.score1 + 2))
-        {
-            return format!("Win for {}", self.player2_name);
-        }
-
-        // Advantage Situation
-        if self.score1 >= 3 && self.score2 >= 3 {
-            if self.score1 == self.score2 + 1 {
-                return format!("Advantage {}", self.player1_name);
-            } else if self.score2 == self.score1 + 1 {
-                return format!("Advantage {}", self.player2_name);
-            }
-        }
-
-        
-        // Tie Situation
-        if self.score1 == self.score2 {
-            if self.score1 > 2 {
-                return "Deuce".to_string();
-            }
-
-            let score1_name = SCORE_NAMES.get(self.score1 as usize).unwrap();
-            return format!("{}-All", score1_name);
-        }
-
-        // Default Situation
-        let score1_name = SCORE_NAMES.get(self.score1 as usize).unwrap();
-        let score2_name = SCORE_NAMES.get(self.score2 as usize).unwrap();
-        format!("{}-{}", score1_name, score2_name)
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }

---- tennis_scoring_tests::check_score::case_03 stdout ----
thread 'tennis_scoring_tests::check_score::case_03' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "Thirty-All"

---- tennis_scoring_tests::check_score::case_04 stdout ----
thread 'tennis_scoring_tests::check_score::case_04' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "Thirty-All"

---- tennis_scoring_tests::check_score::case_02 stdout ----
thread 'tennis_scoring_tests::check_score::case_02' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "Fifteen-All"

failures:
    tennis_scoring_tests::check_score::case_01
    tennis_scoring_tests::check_score::case_02
    tennis_scoring_tests::check_score::case_03
    tennis_scoring_tests::check_score::case_04
    tennis_scoring_tests::check_score::case_05
    tennis_scoring_tests::check_score::case_06
    tennis_scoring_tests::check_score::case_07
    tennis_scoring_tests::check_score::case_08
    tennis_scoring_tests::check_score::case_09
    tennis_scoring_tests::check_score::case_10
    tennis_scoring_tests::check_score::case_11
    tennis_scoring_tests::check_score::case_12

test result: FAILED. 3 passed; 44 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
