*** src/tennis_scoring.rs:34:13: replace || with && in TennisGame::get_score

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace || with && in TennisGame::get_score
@@ -26,17 +26,17 @@
         self.score2 = score2;
 
         return self;
     }
 
     pub fn get_score(&self) -> String {
         // Game Over Situation (One player wins)
         if (self.score1 == 4 && self.score2 <= 2)
-            || (self.score1 > 4 && self.score1 >= (self.score2 + 2))
+            && /* ~ changed by cargo-mutants ~ */ (self.score1 > 4 && self.score1 >= (self.score2 + 2))
         {
             return format!("Win for {}", self.player1_name);
         }
 
         if (self.score2 == 4 && self.score1 <= 2)
             || (self.score2 > 4 && self.score2 >= (self.score1 + 2))
         {
             return format!("Win for {}", self.player2_name);

---- tennis_scoring_tests::check_score::case_08 stdout ----
thread 'tennis_scoring_tests::check_score::case_08' panicked at src/tennis_scoring.rs:66:65:
called `Option::unwrap()` on a `None` value

---- tennis_scoring_tests::check_score::case_10 stdout ----
thread 'tennis_scoring_tests::check_score::case_10' panicked at src/tennis_scoring.rs:66:65:
called `Option::unwrap()` on a `None` value

---- tennis_scoring_tests::check_score::case_12 stdout ----
thread 'tennis_scoring_tests::check_score::case_12' panicked at src/tennis_scoring.rs:66:65:
called `Option::unwrap()` on a `None` value

failures:
    tennis_scoring_tests::check_score::case_08
    tennis_scoring_tests::check_score::case_10
    tennis_scoring_tests::check_score::case_12
    tennis_scoring_tests::check_score::case_14
    tennis_scoring_tests::check_score::case_16
    tennis_scoring_tests::check_score::case_17

test result: FAILED. 41 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
