*** src/tennis_scoring.rs:34:64: replace + with - in TennisGame::get_score

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace + with - in TennisGame::get_score
@@ -26,17 +26,17 @@
         self.score2 = score2;
 
         return self;
     }
 
     pub fn get_score(&self) -> String {
         // Game Over Situation (One player wins)
         if (self.score1 == 4 && self.score2 <= 2)
-            || (self.score1 > 4 && self.score1 >= (self.score2 + 2))
+            || (self.score1 > 4 && self.score1 >= (self.score2 - /* ~ changed by cargo-mutants ~ */ 2))
         {
             return format!("Win for {}", self.player1_name);
         }
 
         if (self.score2 == 4 && self.score1 <= 2)
             || (self.score2 > 4 && self.score2 >= (self.score1 + 2))
         {
             return format!("Win for {}", self.player2_name);

---- tennis_scoring_tests::check_score::case_18 stdout ----
thread 'tennis_scoring_tests::check_score::case_18' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for player1"
 right: "Win for player2"

---- tennis_scoring_tests::check_score::case_19 stdout ----
thread 'tennis_scoring_tests::check_score::case_19' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for player1"
 right: "Win for player2"

---- tennis_scoring_tests::check_score::case_22 stdout ----
thread 'tennis_scoring_tests::check_score::case_22' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for player1"
 right: "Advantage player1"

failures:
    tennis_scoring_tests::check_score::case_18
    tennis_scoring_tests::check_score::case_19
    tennis_scoring_tests::check_score::case_22
    tennis_scoring_tests::check_score::case_24
    tennis_scoring_tests::check_score::case_25
    tennis_scoring_tests::check_score::case_26
    tennis_scoring_tests::check_score::case_27
    tennis_scoring_tests::check_score::case_41
    tennis_scoring_tests::check_score::case_42
    tennis_scoring_tests::check_score::case_43
    tennis_scoring_tests::check_score::case_44

test result: FAILED. 36 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
