*** src/tennis_scoring.rs:39:25: replace == with != in TennisGame::get_score

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace == with != in TennisGame::get_score
@@ -31,17 +31,17 @@
     pub fn get_score(&self) -> String {
         // Game Over Situation (One player wins)
         if (self.score1 == 4 && self.score2 <= 2)
             || (self.score1 > 4 && self.score1 >= (self.score2 + 2))
         {
             return format!("Win for {}", self.player1_name);
         }
 
-        if (self.score2 == 4 && self.score1 <= 2)
+        if (self.score2 != /* ~ changed by cargo-mutants ~ */ 4 && self.score1 <= 2)
             || (self.score2 > 4 && self.score2 >= (self.score1 + 2))
         {
             return format!("Win for {}", self.player2_name);
         }
 
         // Advantage Situation
         if self.score1 >= 3 && self.score2 >= 3 {
             if self.score1 == self.score2 + 1 {

---- tennis_scoring_tests::check_score::case_01 stdout ----
thread 'tennis_scoring_tests::check_score::case_01' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for player2"
 right: "Love-All"

---- tennis_scoring_tests::check_score::case_02 stdout ----
thread 'tennis_scoring_tests::check_score::case_02' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for player2"
 right: "Fifteen-All"

---- tennis_scoring_tests::check_score::case_04 stdout ----
thread 'tennis_scoring_tests::check_score::case_04' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for player2"
 right: "Thirty-All"

failures:
    tennis_scoring_tests::check_score::case_01
    tennis_scoring_tests::check_score::case_02
    tennis_scoring_tests::check_score::case_03
    tennis_scoring_tests::check_score::case_04
    tennis_scoring_tests::check_score::case_05
    tennis_scoring_tests::check_score::case_06
    tennis_scoring_tests::check_score::case_07
    tennis_scoring_tests::check_score::case_09
    tennis_scoring_tests::check_score::case_11
    tennis_scoring_tests::check_score::case_13
    tennis_scoring_tests::check_score::case_28
    tennis_scoring_tests::check_score::case_29

test result: FAILED. 28 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
