*** src/tennis_scoring.rs:40:13: replace || with && in TennisGame::get_score

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace || with && in TennisGame::get_score
@@ -32,17 +32,17 @@
         // Game Over Situation (One player wins)
         if (self.score1 == 4 && self.score2 <= 2)
             || (self.score1 > 4 && self.score1 >= (self.score2 + 2))
         {
             return format!("Win for {}", self.player1_name);
         }
 
         if (self.score2 == 4 && self.score1 <= 2)
-            || (self.score2 > 4 && self.score2 >= (self.score1 + 2))
+            && /* ~ changed by cargo-mutants ~ */ (self.score2 > 4 && self.score2 >= (self.score1 + 2))
         {
             return format!("Win for {}", self.player2_name);
         }
 
         // Advantage Situation
         if self.score1 >= 3 && self.score2 >= 3 {
             if self.score1 == self.score2 + 1 {
                 return format!("Advantage {}", self.player1_name);

---- tennis_scoring_tests::check_score::case_09 stdout ----
thread 'tennis_scoring_tests::check_score::case_09' panicked at src/tennis_scoring.rs:67:65:
called `Option::unwrap()` on a `None` value

---- tennis_scoring_tests::check_score::case_11 stdout ----
thread 'tennis_scoring_tests::check_score::case_11' panicked at src/tennis_scoring.rs:67:65:
called `Option::unwrap()` on a `None` value

---- tennis_scoring_tests::check_score::case_13 stdout ----
thread 'tennis_scoring_tests::check_score::case_13' panicked at src/tennis_scoring.rs:67:65:
called `Option::unwrap()` on a `None` value

failures:
    tennis_scoring_tests::check_score::case_09
    tennis_scoring_tests::check_score::case_11
    tennis_scoring_tests::check_score::case_13
    tennis_scoring_tests::check_score::case_15
    tennis_scoring_tests::check_score::case_18
    tennis_scoring_tests::check_score::case_19

test result: FAILED. 41 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
