*** src/tennis_scoring.rs:40:33: replace && with || in TennisGame::get_score

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace && with || in TennisGame::get_score
@@ -32,17 +32,17 @@
         // Game Over Situation (One player wins)
         if (self.score1 == 4 && self.score2 <= 2)
             || (self.score1 > 4 && self.score1 >= (self.score2 + 2))
         {
             return format!("Win for {}", self.player1_name);
         }
 
         if (self.score2 == 4 && self.score1 <= 2)
-            || (self.score2 > 4 && self.score2 >= (self.score1 + 2))
+            || (self.score2 > 4 || /* ~ changed by cargo-mutants ~ */ self.score2 >= (self.score1 + 2))
         {
             return format!("Win for {}", self.player2_name);
         }
 
         // Advantage Situation
         if self.score1 >= 3 && self.score2 >= 3 {
             if self.score1 == self.score2 + 1 {
                 return format!("Advantage {}", self.player1_name);

---- tennis_scoring_tests::check_score::case_27 stdout ----
thread 'tennis_scoring_tests::check_score::case_27' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for player2"
 right: "Advantage player2"

---- tennis_scoring_tests::check_score::case_26 stdout ----
thread 'tennis_scoring_tests::check_score::case_26' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for player2"
 right: "Advantage player1"

---- tennis_scoring_tests::check_score::case_24 stdout ----
thread 'tennis_scoring_tests::check_score::case_24' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Win for player2"
 right: "Advantage player1"

failures:
    tennis_scoring_tests::check_score::case_23
    tennis_scoring_tests::check_score::case_24
    tennis_scoring_tests::check_score::case_25
    tennis_scoring_tests::check_score::case_26
    tennis_scoring_tests::check_score::case_27
    tennis_scoring_tests::check_score::case_31
    tennis_scoring_tests::check_score::case_33
    tennis_scoring_tests::check_score::case_36
    tennis_scoring_tests::check_score::case_41
    tennis_scoring_tests::check_score::case_42
    tennis_scoring_tests::check_score::case_43
    tennis_scoring_tests::check_score::case_44

test result: FAILED. 35 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
