*** src/tennis_scoring.rs:46:24: replace >= with < in TennisGame::get_score

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace >= with < in TennisGame::get_score
@@ -38,17 +38,17 @@
 
         if (self.score2 == 4 && self.score1 <= 2)
             || (self.score2 > 4 && self.score2 >= (self.score1 + 2))
         {
             return format!("Win for {}", self.player2_name);
         }
 
         // Advantage Situation
-        if self.score1 >= 3 && self.score2 >= 3 {
+        if self.score1 < /* ~ changed by cargo-mutants ~ */ 3 && self.score2 >= 3 {
             if self.score1 == self.score2 + 1 {
                 return format!("Advantage {}", self.player1_name);
             } else if self.score2 == self.score1 + 1 {
                 return format!("Advantage {}", self.player2_name);
             }
         }

---- tennis_scoring_tests::check_score::case_20 stdout ----
thread 'tennis_scoring_tests::check_score::case_20' panicked at src/tennis_scoring.rs:66:65:
called `Option::unwrap()` on a `None` value

---- tennis_scoring_tests::check_score::case_22 stdout ----
thread 'tennis_scoring_tests::check_score::case_22' panicked at src/tennis_scoring.rs:66:65:
called `Option::unwrap()` on a `None` value

---- tennis_scoring_tests::check_score::case_23 stdout ----
thread 'tennis_scoring_tests::check_score::case_23' panicked at src/tennis_scoring.rs:66:65:
called `Option::unwrap()` on a `None` value

failures:
    tennis_scoring_tests::check_score::case_20
    tennis_scoring_tests::check_score::case_21
    tennis_scoring_tests::check_score::case_22
    tennis_scoring_tests::check_score::case_23
    tennis_scoring_tests::check_score::case_24
    tennis_scoring_tests::check_score::case_25
    tennis_scoring_tests::check_score::case_26
    tennis_scoring_tests::check_score::case_27
    tennis_scoring_tests::check_score::case_38

test result: FAILED. 38 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
