*** src/tennis_scoring.rs:46:29: replace && with || in TennisGame::get_score

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace && with || in TennisGame::get_score
@@ -38,17 +38,17 @@
 
         if (self.score2 == 4 && self.score1 <= 2)
             || (self.score2 > 4 && self.score2 >= (self.score1 + 2))
         {
             return format!("Win for {}", self.player2_name);
         }
 
         // Advantage Situation
-        if self.score1 >= 3 && self.score2 >= 3 {
+        if self.score1 >= 3 || /* ~ changed by cargo-mutants ~ */ self.score2 >= 3 {
             if self.score1 == self.score2 + 1 {
                 return format!("Advantage {}", self.player1_name);
             } else if self.score2 == self.score1 + 1 {
                 return format!("Advantage {}", self.player2_name);
             }
         }

---- tennis_scoring_tests::check_score::case_39 stdout ----
thread 'tennis_scoring_tests::check_score::case_39' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Advantage player1"
 right: "Forty-Thirty"

---- tennis_scoring_tests::check_score::case_38 stdout ----
thread 'tennis_scoring_tests::check_score::case_38' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Advantage player2"
 right: "Thirty-Forty"

failures:
    tennis_scoring_tests::check_score::case_38
    tennis_scoring_tests::check_score::case_39

test result: FAILED. 45 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
