*** src/tennis_scoring.rs:47:43: replace + with - in TennisGame::get_score

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace + with - in TennisGame::get_score
@@ -39,17 +39,17 @@
         if (self.score2 == 4 && self.score1 <= 2)
             || (self.score2 > 4 && self.score2 >= (self.score1 + 2))
         {
             return format!("Win for {}", self.player2_name);
         }
 
         // Advantage Situation
         if self.score1 >= 3 && self.score2 >= 3 {
-            if self.score1 == self.score2 + 1 {
+            if self.score1 == self.score2 - /* ~ changed by cargo-mutants ~ */ 1 {
                 return format!("Advantage {}", self.player1_name);
             } else if self.score2 == self.score1 + 1 {
                 return format!("Advantage {}", self.player2_name);
             }
         }
 
         
         // Tie Situation

---- tennis_scoring_tests::check_score::case_24 stdout ----
thread 'tennis_scoring_tests::check_score::case_24' panicked at src/tennis_scoring.rs:66:65:
called `Option::unwrap()` on a `None` value

---- tennis_scoring_tests::check_score::case_21 stdout ----
thread 'tennis_scoring_tests::check_score::case_21' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Advantage player1"
 right: "Advantage player2"

---- tennis_scoring_tests::check_score::case_20 stdout ----
thread 'tennis_scoring_tests::check_score::case_20' panicked at src/tennis_scoring.rs:66:65:
called `Option::unwrap()` on a `None` value

failures:
    tennis_scoring_tests::check_score::case_20
    tennis_scoring_tests::check_score::case_21
    tennis_scoring_tests::check_score::case_22
    tennis_scoring_tests::check_score::case_23
    tennis_scoring_tests::check_score::case_24
    tennis_scoring_tests::check_score::case_25
    tennis_scoring_tests::check_score::case_26
    tennis_scoring_tests::check_score::case_27

test result: FAILED. 39 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
