*** src/tennis_scoring.rs:49:50: replace + with * in TennisGame::get_score

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace + with * in TennisGame::get_score
@@ -41,17 +41,17 @@
         {
             return format!("Win for {}", self.player2_name);
         }
 
         // Advantage Situation
         if self.score1 >= 3 && self.score2 >= 3 {
             if self.score1 == self.score2 + 1 {
                 return format!("Advantage {}", self.player1_name);
-            } else if self.score2 == self.score1 + 1 {
+            } else if self.score2 == self.score1 * /* ~ changed by cargo-mutants ~ */ 1 {
                 return format!("Advantage {}", self.player2_name);
             }
         }
 
         
         // Tie Situation
         if self.score1 == self.score2 {
             if self.score1 > 2 {

---- tennis_scoring_tests::check_score::case_21 stdout ----
thread 'tennis_scoring_tests::check_score::case_21' panicked at src/tennis_scoring.rs:67:65:
called `Option::unwrap()` on a `None` value

---- tennis_scoring_tests::check_score::case_23 stdout ----
thread 'tennis_scoring_tests::check_score::case_23' panicked at src/tennis_scoring.rs:66:65:
called `Option::unwrap()` on a `None` value

---- tennis_scoring_tests::check_score::case_25 stdout ----
thread 'tennis_scoring_tests::check_score::case_25' panicked at src/tennis_scoring.rs:66:65:
called `Option::unwrap()` on a `None` value

failures:
    tennis_scoring_tests::check_score::case_21
    tennis_scoring_tests::check_score::case_23
    tennis_scoring_tests::check_score::case_25
    tennis_scoring_tests::check_score::case_27
    tennis_scoring_tests::check_score::case_40
    tennis_scoring_tests::check_score::case_41
    tennis_scoring_tests::check_score::case_42
    tennis_scoring_tests::check_score::case_43
    tennis_scoring_tests::check_score::case_44

test result: FAILED. 38 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
