*** src/tennis_scoring.rs:56:24: replace == with != in TennisGame::get_score

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace == with != in TennisGame::get_score
@@ -48,17 +48,17 @@
                 return format!("Advantage {}", self.player1_name);
             } else if self.score2 == self.score1 + 1 {
                 return format!("Advantage {}", self.player2_name);
             }
         }
 
         
         // Tie Situation
-        if self.score1 == self.score2 {
+        if self.score1 != /* ~ changed by cargo-mutants ~ */ self.score2 {
             if self.score1 > 2 {
                 return "Deuce".to_string();
             }
 
             let score1_name = SCORE_NAMES.get(self.score1 as usize).unwrap();
             return format!("{}-All", score1_name);
         }

---- tennis_scoring_tests::check_score::case_02 stdout ----
thread 'tennis_scoring_tests::check_score::case_02' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Fifteen-Fifteen"
 right: "Fifteen-All"

---- tennis_scoring_tests::check_score::case_04 stdout ----
thread 'tennis_scoring_tests::check_score::case_04' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Thirty-Thirty"
 right: "Thirty-All"

---- tennis_scoring_tests::check_score::case_01 stdout ----
thread 'tennis_scoring_tests::check_score::case_01' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Love-Love"
 right: "Love-All"

failures:
    tennis_scoring_tests::check_score::case_01
    tennis_scoring_tests::check_score::case_02
    tennis_scoring_tests::check_score::case_03
    tennis_scoring_tests::check_score::case_04
    tennis_scoring_tests::check_score::case_05
    tennis_scoring_tests::check_score::case_06
    tennis_scoring_tests::check_score::case_07
    tennis_scoring_tests::check_score::case_28
    tennis_scoring_tests::check_score::case_29
    tennis_scoring_tests::check_score::case_30
    tennis_scoring_tests::check_score::case_31
    tennis_scoring_tests::check_score::case_32

test result: FAILED. 23 passed; 24 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
