*** src/tennis_scoring.rs:57:28: replace > with < in TennisGame::get_score

*** mutation diff:
--- src/tennis_scoring.rs
+++ replace > with < in TennisGame::get_score
@@ -49,17 +49,17 @@
             } else if self.score2 == self.score1 + 1 {
                 return format!("Advantage {}", self.player2_name);
             }
         }
 
         
         // Tie Situation
         if self.score1 == self.score2 {
-            if self.score1 > 2 {
+            if self.score1 < /* ~ changed by cargo-mutants ~ */ 2 {
                 return "Deuce".to_string();
             }
 
             let score1_name = SCORE_NAMES.get(self.score1 as usize).unwrap();
             return format!("{}-All", score1_name);
         }
 
         // Default Situation

---- tennis_scoring_tests::check_score::case_02 stdout ----
thread 'tennis_scoring_tests::check_score::case_02' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Deuce"
 right: "Fifteen-All"

---- tennis_scoring_tests::check_score::case_01 stdout ----
thread 'tennis_scoring_tests::check_score::case_01' panicked at src/tennis_scoring_tests.rs:80:5:
assertion `left == right` failed
  left: "Deuce"
 right: "Love-All"

---- tennis_scoring_tests::check_score::case_40 stdout ----
thread 'tennis_scoring_tests::check_score::case_40' panicked at src/tennis_scoring.rs:61:69:
called `Option::unwrap()` on a `None` value

failures:
    tennis_scoring_tests::check_score::case_01
    tennis_scoring_tests::check_score::case_02
    tennis_scoring_tests::check_score::case_40
    tennis_scoring_tests::check_score::case_41
    tennis_scoring_tests::check_score::case_42
    tennis_scoring_tests::check_score::case_43
    tennis_scoring_tests::check_score::case_44

test result: FAILED. 40 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
