*** src/tennis_scoring_tests.rs:75:5: replace check_score with ()

*** mutation diff:
--- src/tennis_scoring_tests.rs
+++ replace check_score with ()
@@ -67,15 +67,10 @@
 #[case(2, 3, "Thirty-Forty")]
 #[case(3, 2, "Forty-Thirty")]
 #[case(4, 4, "Deuce")]
 #[case(5, 5, "Deuce")]
 #[case(6, 6, "Deuce")]
 #[case(8, 8, "Deuce")]
 #[case(42, 42, "Deuce")]
 fn check_score(#[case] score1: u8, #[case] score2: u8, #[case] expected_result: &str) {
-    let mut game = TennisGame::new();
-
-    game.set_names("player1".to_string(), "player2".to_string());
-    game.set_score(score1, score2);
-
-    assert_eq!(game.get_score(), expected_result);
+    () /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
